_org/example.org
#+TITLE: Steps for EBS Migration To OPC for CKHH
#+AUTHOR: Oracle
#+OPTIONS: ^:nil toc:nil
#+BEGIN_EXPORT html
title: First Post
published_date: "2018-10-25 07:37:06 +0000"
layout: post.liquid
is_draft: false
---
#+END_EXPORT

* OS Preparation
** Create VM Instances
   | Name      | Shape |         Pub ip |       Priv ip | Data disk       | Usage              |
   |-----------+-------+----------------+---------------+-----------------+--------------------|
   | dberp01   | oc6   | 129.150.102.93 | 172.28.110.19 | 5TB + 2TB stage | DB                 |
   | apperpu01 | oc4   | 129.150.101.41 | 172.28.110.17 | 300GB           | Primary EBS node   |
   | apperpu02 | oc4   | 129.150.101.53 | 172.18.110.18 | 300GB           | Secondary EBS node |

** User
   In all nodes
   #+BEGIN_EXAMPLE
     $ sudo useradd erp28 -u 2328
     $ sudo groupadd dba -g 23
     $ sudo usermod -g dba erp28
   #+END_EXAMPLE

** Package
   1. Revise /etc/yum.repos.d/public-yum-ol6.repo in all nodes. Modify the `ol6_addons' section as following
      #+BEGIN_EXAMPLE
        [ol6_addons]
        name=Oracle Linux $releasever Add ons ($basearch)
        baseurl=http://public-yum.oracle.com/repo/OracleLinux/OL6/addons/$basearch/
        gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-oracle
        gpgcheck=1
        enabled=1
      #+END_EXAMPLE
   2. In DB node dberpu01
      #+BEGIN_EXAMPLE
        $ sudo yum install oracle-rdbms-server-11gR2-preinstall.x86_64
      #+END_EXAMPLE
   
   3. In app tier nodes apperpu01, apperpu02
      #+BEGIN_EXAMPLE
        $ sudo yum install oracle-ebs-server-R12-preinstall.x86_64
      #+END_EXAMPLE

   4. Upgrade this package to prevent potential LVM related problems.
      #+BEGIN_EXAMPLE
        $ sudo yum upgrade device-mapper-libs
      #+END_EXAMPLE

   5. Install the following packages for remote operations
      #+BEGIN_EXAMPLE
        $ sudo yum install tigervnc-server xterm twm
      #+END_EXAMPLE

** Revise /etc/security/limits.conf
   In all nodes, replace `oracle' with `erp28'

** Revise /etc/hosts
   Add the following content to all nodes
   #+BEGIN_EXAMPLE
     172.28.110.11	otdu01	otdu01.ckh.oc.com
     172.28.110.12	otdu02	otdu02.ckh.oc.com
     172.28.110.13	ftpu01	ftpu01.ckh.oc.com
     172.28.110.14	ftpu02	ftpu02.ckh.oc.com
     172.28.110.15	prtu01	prtu01.ckh.oc.com
     172.28.110.16	smtpu01	smtpu01.ckh.oc.com
     172.28.110.17	apperpu01	apperpu01.ckh.oc.com
     172.28.110.18	apperpu02	apperpu02.ckh.oc.com
     172.28.110.19	dberpu01	dberpu01.ckh.oc.com
     172.28.110.20	uerp28	        uerp28.ckh.oc.com
     #172.28.110.21	uerp28db	uerp28db.ckh.oc.com
     172.28.110.19	uerp28db	uerp28db.ckh.oc.com
   #+END_EXAMPLE

** Create /etc/oraInst.loc If Not Exists
   In two app nodes(apperpu01, apperpu02), create oraInst.loc file with content as following
   #+BEGIN_EXAMPLE
     inventory_loc=/home/erp28/oraInventory
     inst_group=dba
   #+END_EXAMPLE
** Data Disk Preparation
   | Node      | VG name    | LV name   | Size  |
   |-----------+------------+-----------+-------|
   | dberpu01  | vg_data    | datalv    | 5TB   |
   | dberpu01  | vg_stage   | stagelv   | 2TB   |
   | dberpu01  | vg_project | projectlv | 40GB  |
   | apperpu01 | vg_project | projectlv | 300GB |
   | apperpu02 | vg_porject | projectlv | 300GB |

* Backup Preparation
  Download from Object storage container `CKHHPOC', following is the core download method with which we compose batch download script

  #+BEGIN_EXAMPLE
    Get the list
    $ curl -v -X GET -u franco.chong@oracle.com:Zaq1xsw2 \
      https://a516732.storage.oraclecloud.com/v1/Storage-a516732/CKHHPOC/ > ckhhpoc_full.list

    Download the file
    $ curl -v -X GET -O -u franco.chong@oracle.com:Zaq1xsw2 \
      https://a516732.storage.oraclecloud.com/v1/Storage-a516732/CKHHPOC/oracle0929/dbbackup/incremental_0_0ssf3vpd_13_1
  #+END_EXAMPLE

* Database Restore and Recovery
  Following tasks all done in node dberpu01

** Restore DB Software Backup from Stage
   #+BEGIN_EXAMPLE
     $ tar zxvf /stage/CKHHPOC/oracle/filebackup/db_home_20170926.tar.gz -C /project/UERP28/db
   #+END_EXAMPLE
** Modify TNS Network Files
   Revise following files under /project/UERP28/db/11.2.0/network/admin/UERP28_uerp28db with hostname uerp28db (virtual name)

   1. listener.ora
   2. sqlnet.ora
   3. tnsnames.ora

** Enter RMAN
   #+BEGIN_EXAMPLE
     $ export TNS_ADMIN=/project/UERP28/db/11.2.0/network/admin/UERP28_uerp28db
     $ export ORACLE_HOME=/project/UERP28/db/11.2.0
     $ export ORACLE_SID=UERP28
     $ export PATH=$ORACLE_HOME/bin:$PATH
   #+END_EXAMPLE

   #+BEGIN_EXAMPLE
     sqlplus / as sysdba
     SQL> startup nomount
     SQL> exit
   #+END_EXAMPLE

   #+BEGIN_EXAMPLE
     rman target /
   #+END_EXAMPLE

** Restore Controlfile
   #+BEGIN_EXAMPLE
     RMAN> restore controlfile from '/UERP28_db01/dbdump/arch/ctrl_0_1fsf4biq_1_1';
   #+END_EXAMPLE

** Restore Database
   #+BEGIN_EXAMPLE
     RMAN> catalog start with '/stage/CKHHPOC/oracle/dbbackup/' noprompt;
     RMAN> set decryption identified by 'Welcome1';
     RMAN> configure device type disk parallelism 16;
     RMAN> restore database;
   #+END_EXAMPLE

** Prepare Incremental Archivelogs and Redologs
   #+BEGIN_EXAMPLE
     [erp28@dberpu01 stage]$ tar zxvf incremental_archivelogs.tar.gz -C /UERP28_db01/dbdump
   #+END_EXAMPLE

   #+BEGIN_EXAMPLE
     [erp28@dberpu01 stage]$ tar zxvf redologs.tar.gz -C /UERP28_db01/data/
   #+END_EXAMPLE

** Recover Database
   #+BEGIN_EXAMPLE
     RMAN> recover database;
   #+END_EXAMPLE

** Open Database
   #+BEGIN_EXAMPLE
     RMAN> alter database open resetlogs;
   #+END_EXAMPLE

