_site/posts/example.html
<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">
        <title>First Post</title>
        <link rel="stylesheet" href="../css/base.css">
	<link rel="stylesheet" href="../css/layout.css">
        <link rel="stylesheet" href="../css/styles.css">
    </head>
    <body>
    <div>
      <h2>First Post</h2>
      <div id="outline-container-orgcb8575f" class="outline-2">
<h2 id="orgcb8575f">OS Preparation</h2>
<div class="outline-text-2" id="text-orgcb8575f">
</div>
<div id="outline-container-org432b812" class="outline-3">
<h3 id="org432b812">Create VM Instances</h3>
<div class="outline-text-3" id="text-org432b812">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-right">

<col  class="org-right">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Shape</th>
<th scope="col" class="org-right">Pub ip</th>
<th scope="col" class="org-right">Priv ip</th>
<th scope="col" class="org-left">Data disk</th>
<th scope="col" class="org-left">Usage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dberp01</td>
<td class="org-left">oc6</td>
<td class="org-right">129.150.102.93</td>
<td class="org-right">172.28.110.19</td>
<td class="org-left">5TB + 2TB stage</td>
<td class="org-left">DB</td>
</tr>

<tr>
<td class="org-left">apperpu01</td>
<td class="org-left">oc4</td>
<td class="org-right">129.150.101.41</td>
<td class="org-right">172.28.110.17</td>
<td class="org-left">300GB</td>
<td class="org-left">Primary EBS node</td>
</tr>

<tr>
<td class="org-left">apperpu02</td>
<td class="org-left">oc4</td>
<td class="org-right">129.150.101.53</td>
<td class="org-right">172.18.110.18</td>
<td class="org-left">300GB</td>
<td class="org-left">Secondary EBS node</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd250b78" class="outline-3">
<h3 id="orgd250b78">User</h3>
<div class="outline-text-3" id="text-orgd250b78">
<p>
In all nodes
</p>
<pre class="example">
$ sudo useradd erp28 -u 2328
$ sudo groupadd dba -g 23
$ sudo usermod -g dba erp28
</pre>
</div>
</div>

<div id="outline-container-orge54ba99" class="outline-3">
<h3 id="orge54ba99">Package</h3>
<div class="outline-text-3" id="text-orge54ba99">
<ol class="org-ol">
<li><p>
Revise /etc/yum.repos.d/public-yum-ol6.repo in all nodes. Modify the `ol6_addons' section as following
</p>
<pre class="example">
[ol6_addons]
name=Oracle Linux $releasever Add ons ($basearch)
baseurl=http://public-yum.oracle.com/repo/OracleLinux/OL6/addons/$basearch/
gpgkey=file:///etc/pki/rpm-gpg/RPM-GPG-KEY-oracle
gpgcheck=1
enabled=1
</pre></li>
<li><p>
In DB node dberpu01
</p>
<pre class="example">
$ sudo yum install oracle-rdbms-server-11gR2-preinstall.x86_64
</pre></li>

<li><p>
In app tier nodes apperpu01, apperpu02
</p>
<pre class="example">
$ sudo yum install oracle-ebs-server-R12-preinstall.x86_64
</pre></li>

<li><p>
Upgrade this package to prevent potential LVM related problems.
</p>
<pre class="example">
$ sudo yum upgrade device-mapper-libs
</pre></li>

<li><p>
Install the following packages for remote operations
</p>
<pre class="example">
$ sudo yum install tigervnc-server xterm twm
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-org0969381" class="outline-3">
<h3 id="org0969381">Revise /etc/security/limits.conf</h3>
<div class="outline-text-3" id="text-org0969381">
<p>
In all nodes, replace `oracle' with `erp28'
</p>
</div>
</div>

<div id="outline-container-orgb1d98c8" class="outline-3">
<h3 id="orgb1d98c8">Revise /etc/hosts</h3>
<div class="outline-text-3" id="text-orgb1d98c8">
<p>
Add the following content to all nodes
</p>
<pre class="example">
172.28.110.11	otdu01	otdu01.ckh.oc.com
172.28.110.12	otdu02	otdu02.ckh.oc.com
172.28.110.13	ftpu01	ftpu01.ckh.oc.com
172.28.110.14	ftpu02	ftpu02.ckh.oc.com
172.28.110.15	prtu01	prtu01.ckh.oc.com
172.28.110.16	smtpu01	smtpu01.ckh.oc.com
172.28.110.17	apperpu01	apperpu01.ckh.oc.com
172.28.110.18	apperpu02	apperpu02.ckh.oc.com
172.28.110.19	dberpu01	dberpu01.ckh.oc.com
172.28.110.20	uerp28	        uerp28.ckh.oc.com
#172.28.110.21	uerp28db	uerp28db.ckh.oc.com
172.28.110.19	uerp28db	uerp28db.ckh.oc.com
</pre>
</div>
</div>

<div id="outline-container-orgbde1c6f" class="outline-3">
<h3 id="orgbde1c6f">Create /etc/oraInst.loc If Not Exists</h3>
<div class="outline-text-3" id="text-orgbde1c6f">
<p>
In two app nodes(apperpu01, apperpu02), create oraInst.loc file with content as following
</p>
<pre class="example">
inventory_loc=/home/erp28/oraInventory
inst_group=dba
</pre>
</div>
</div>
<div id="outline-container-orgea9b9dc" class="outline-3">
<h3 id="orgea9b9dc">Data Disk Preparation</h3>
<div class="outline-text-3" id="text-orgea9b9dc">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Node</th>
<th scope="col" class="org-left">VG name</th>
<th scope="col" class="org-left">LV name</th>
<th scope="col" class="org-left">Size</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dberpu01</td>
<td class="org-left">vg_data</td>
<td class="org-left">datalv</td>
<td class="org-left">5TB</td>
</tr>

<tr>
<td class="org-left">dberpu01</td>
<td class="org-left">vg_stage</td>
<td class="org-left">stagelv</td>
<td class="org-left">2TB</td>
</tr>

<tr>
<td class="org-left">dberpu01</td>
<td class="org-left">vg_project</td>
<td class="org-left">projectlv</td>
<td class="org-left">40GB</td>
</tr>

<tr>
<td class="org-left">apperpu01</td>
<td class="org-left">vg_project</td>
<td class="org-left">projectlv</td>
<td class="org-left">300GB</td>
</tr>

<tr>
<td class="org-left">apperpu02</td>
<td class="org-left">vg_porject</td>
<td class="org-left">projectlv</td>
<td class="org-left">300GB</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgb10a8b7" class="outline-2">
<h2 id="orgb10a8b7">Backup Preparation</h2>
<div class="outline-text-2" id="text-orgb10a8b7">
<p>
Download from Object storage container `CKHHPOC', following is the core download method with which we compose batch download script
</p>

<pre class="example">
Get the list
$ curl -v -X GET -u franco.chong@oracle.com:Zaq1xsw2 \
  https://a516732.storage.oraclecloud.com/v1/Storage-a516732/CKHHPOC/ &gt; ckhhpoc_full.list

Download the file
$ curl -v -X GET -O -u franco.chong@oracle.com:Zaq1xsw2 \
  https://a516732.storage.oraclecloud.com/v1/Storage-a516732/CKHHPOC/oracle0929/dbbackup/incremental_0_0ssf3vpd_13_1
</pre>
</div>
</div>

<div id="outline-container-org2101981" class="outline-2">
<h2 id="org2101981">Database Restore and Recovery</h2>
<div class="outline-text-2" id="text-org2101981">
<p>
Following tasks all done in node dberpu01
</p>
</div>

<div id="outline-container-org5ef05f5" class="outline-3">
<h3 id="org5ef05f5">Restore DB Software Backup from Stage</h3>
<div class="outline-text-3" id="text-org5ef05f5">
<pre class="example">
$ tar zxvf /stage/CKHHPOC/oracle/filebackup/db_home_20170926.tar.gz -C /project/UERP28/db
</pre>
</div>
</div>
<div id="outline-container-org02e9dd4" class="outline-3">
<h3 id="org02e9dd4">Modify TNS Network Files</h3>
<div class="outline-text-3" id="text-org02e9dd4">
<p>
Revise following files under /project/UERP28/db/11.2.0/network/admin/UERP28_uerp28db with hostname uerp28db (virtual name)
</p>

<ol class="org-ol">
<li>listener.ora</li>
<li>sqlnet.ora</li>
<li>tnsnames.ora</li>
</ol>
</div>
</div>

<div id="outline-container-org971a5e4" class="outline-3">
<h3 id="org971a5e4">Enter RMAN</h3>
<div class="outline-text-3" id="text-org971a5e4">
<pre class="example">
$ export TNS_ADMIN=/project/UERP28/db/11.2.0/network/admin/UERP28_uerp28db
$ export ORACLE_HOME=/project/UERP28/db/11.2.0
$ export ORACLE_SID=UERP28
$ export PATH=$ORACLE_HOME/bin:$PATH
</pre>

<pre class="example">
sqlplus / as sysdba
SQL&gt; startup nomount
SQL&gt; exit
</pre>

<pre class="example">
rman target /
</pre>
</div>
</div>

<div id="outline-container-org2f9d723" class="outline-3">
<h3 id="org2f9d723">Restore Controlfile</h3>
<div class="outline-text-3" id="text-org2f9d723">
<pre class="example">
RMAN&gt; restore controlfile from '/UERP28_db01/dbdump/arch/ctrl_0_1fsf4biq_1_1';
</pre>
</div>
</div>

<div id="outline-container-org98bb9c1" class="outline-3">
<h3 id="org98bb9c1">Restore Database</h3>
<div class="outline-text-3" id="text-org98bb9c1">
<pre class="example">
RMAN&gt; catalog start with '/stage/CKHHPOC/oracle/dbbackup/' noprompt;
RMAN&gt; set decryption identified by 'Welcome1';
RMAN&gt; configure device type disk parallelism 16;
RMAN&gt; restore database;
</pre>
</div>
</div>

<div id="outline-container-org12a36f2" class="outline-3">
<h3 id="org12a36f2">Prepare Incremental Archivelogs and Redologs</h3>
<div class="outline-text-3" id="text-org12a36f2">
<pre class="example">
[erp28@dberpu01 stage]$ tar zxvf incremental_archivelogs.tar.gz -C /UERP28_db01/dbdump
</pre>

<pre class="example">
[erp28@dberpu01 stage]$ tar zxvf redologs.tar.gz -C /UERP28_db01/data/
</pre>
</div>
</div>

<div id="outline-container-orga8fb93d" class="outline-3">
<h3 id="orga8fb93d">Recover Database</h3>
<div class="outline-text-3" id="text-orga8fb93d">
<pre class="example">
RMAN&gt; recover database;
</pre>
</div>
</div>

<div id="outline-container-org405a5df" class="outline-3">
<h3 id="org405a5df">Open Database</h3>
<div class="outline-text-3" id="text-org405a5df">
<pre class="example">
RMAN&gt; alter database open resetlogs;
</pre>
</div>
</div>
