_org/example.org
** Check
   #+BEGIN_EXAMPLE
     SQL> select to_char(max(last_update_date), 'YYYY/MM/DD HH:MI:SS') last_update_date from 
          apps.fnd_concurrent_requests

     LAST_UPDATE_DATE
     -------------------
     2017/10/10 05:54:44

   #+END_EXAMPLE

   #+BEGIN_EXAMPLE
     SQL> c/gl/apps.gl
       1* select name from apps.gl_je_headers where name like 'Test%Cloud%'
     SQL> /

     NAME
     --------------------------------------------------------------------------------
     Test-Oracle Cloud POC

   #+END_EXAMPLE

* Configure DB
  1. Run adcfgclone.pl
     #+BEGIN_EXAMPLE
       $ cd /project/UERP28/db/11.2.0/appsutil/clone/bin 
       $ perl adcfgclone.pl dbTechStack
     #+END_EXAMPLE

     Input for the adcfgclone.pl command:
     | Prompt        | Value                                                         |
     |---------------+---------------------------------------------------------------|
     | apps password | apps0246                                                      |
     | hostname      | uerp28db                                                      |
     | domain        | ckh.oc.com                                                    |
     | rac           | n                                                             |
     | sid           | UERP28                                                        |
     | base          | /project/UERP28/db                                            |
     | utl_file_dir  | `/UERP28_db01/dbdump/appl_tmp',                               |
     |               | `/project/UERP28/dbdump/asw/temp',                            |
     |               | `/project/UERP28/db/11.2.0/appsutil/outbound/UERP28_uerp28db' |
     | port pool     | 7                                                             |

  2. Start DB in open mode

  3. Run AutoConfig in the INSTE8_SETUP mode on the database tier as follows:
     #+BEGIN_EXAMPLE
       $ perl /project/UERP28/db/11.2.0/appsutil/bin/adconfig.sh contextfile=<CONTEXT_FILE> \
              run=INSTE8_SETUP
     #+END_EXAMPLE

  4. Run library update script
     #+BEGIN_EXAMPLE
       $ cd /project/UERP28/db/11.2.0/appsutil/install/<CONTEXT NAME>
       $ sqlplus "/ as sysdba" @adupdlib.sql so
     #+END_EXAMPLE

  5. Configure Target database
     #+BEGIN_EXAMPLE
       $ cd /project/UERP28/db/11.2.0/appsutil/clone/bin
       $ perl adcfgclone.pl dbconfig <Database Target Context File>
     #+END_EXAMPLE
* Configure Primary App Tier
** Restore App Tier Software Backup from Stage
   Before clone, need restore fs_ne got from the customer (the reason is because of the customization by customer, the clone will be too time-consuming if fs_ne is not there, this is a special needs from CKHH)
   #+BEGIN_EXAMPLE
     $ tar zxvf /stage/CKHHPOC/oracle/filebackup/fs2_EBSapps_20170926.tar.gz \
           -C /project/UERP28/apps/fs2
     $ tar zxvf /stage/CKHHPOC/oracle/filebackup/fs_ne_EBSapps_20170926.tar.gz \
           -C /project/UERP28/apps
   #+END_EXAMPLE

** Configure
  #+BEGIN_EXAMPLE
    $ cd /project/UERP28/apps/fs2/EBSapps/comn/clone/bin
    $ perl adcfgclone.pl appsTier dualfs
  #+END_EXAMPLE
  
  Input for the adcfgclone.pl command:
  | Prompt                                    | Value                |
  |-------------------------------------------+----------------------|
  | apps password                             | apps0246             |
  | weblogic password                         | wls02468             |
  | hostname                                  | apperpu01            |
  | domain                                    | ckh.oc.com           |
  | sid                                       | UERP28               |
  | db node                                   | uerp28db             |
  | domain                                    | ckh.oc.com           |
  | base                                      | /project/UERP28/apps |
  | instance home                             | /project/UERP28/apps |
  | preserve display                          | n                    |
  | target system display                     | <enter>              |
  | web entry point services                  | enabled              |
  | web application services                  | enabled              |
  | system batch processing services          | enabled              |
  | other services                            | disabled             |
  | the same port values as the source system | n                    |
  | port pool                                 | 3                    |
  | patching fs port pool                     | 2                    |

* Prepare with CKHH Instructions before Configure Multinodes
  Basically just following erp28_post_cloing_20171016.txt instructions from CKHH
* Preclone in Primary App Node
  1. In node apperpu01
     #+BEGIN_EXAMPLE
       $ cd /project/UERP28/apps
       $ . EBSapps.env run
       $ perl $ADMIN_SCRIPTS_HOME/adpreclone.pl appsTier
       $ . EBSapps.env patch
       $ $ADMIN_SCRIPTS_HOME/adadminsrvctl.sh start forcepatchfs
       $ perl $ADMIN_SCRIPTS_HOME/adpreclone.pl appsTier
     #+END_EXAMPLE

  2. Stop  EBS services in apperpu01, package following directories and copy into to apperpu02, then unpack into the same directory structure.
     - /project/UERP28/apps/fs2/EBSapps
     - /project/UERP28/apps/fs_ne

  3. Start all EBS services in apperpu01 including adminserver in patching filesystem.
* Configure Secondary App Node
  1. run adcfgclone.pl
     #+BEGIN_EXAMPLE
       $ cd /project/UERP28/apps/fs2/EBSapps/comn/clone/bin
       $ perl adcfgclone.pl appsTier dualfs
     #+END_EXAMPLE

  2. Add OTD information for secondary node by edit $CONTEXT_FILE
     | Parameter             | Value                                                       |
     |-----------------------+-------------------------------------------------------------|
     | s_url_protocol        | https                                                       |
     | s_local_url_protocol  | https                                                       |
     | s_webentryurlprotocol | https                                                       |
     | s_webentryhost        | uerp28                                                      |
     | s_webentrydomain      | hwl-ebis.com                                                |
     | s_active_webport      | 8828                                                        |
     | s_login_page          | https://uerp28.hwl-ebis.com:8828/OA_HTML/AppsLocalLogin.jsp |
     | s_external_url        | https://uerp28.hwl-ebis.com:8828                            |
    
      Then run autoconfig
    
      Basically, these values are consistent with the value configured for primary node in section [[Prepare with CKHH Instructions before Configure Multinodes]]

