_site/posts/example.html

<div id="outline-container-org0a20380" class="outline-3">
<h3 id="org0a20380">Check</h3>
<div class="outline-text-3" id="text-org0a20380">
<pre class="example">
SQL&gt; select to_char(max(last_update_date), 'YYYY/MM/DD HH:MI:SS') last_update_date from 
     apps.fnd_concurrent_requests

LAST_UPDATE_DATE
-------------------
2017/10/10 05:54:44

</pre>

<pre class="example">
SQL&gt; c/gl/apps.gl
  1* select name from apps.gl_je_headers where name like 'Test%Cloud%'
SQL&gt; /

NAME
--------------------------------------------------------------------------------
Test-Oracle Cloud POC

</pre>
</div>
</div>
</div>

<div id="outline-container-org6f6281a" class="outline-2">
<h2 id="org6f6281a">Configure DB</h2>
<div class="outline-text-2" id="text-org6f6281a">
<ol class="org-ol">
<li><p>
Run adcfgclone.pl
</p>
<pre class="example">
$ cd /project/UERP28/db/11.2.0/appsutil/clone/bin 
$ perl adcfgclone.pl dbTechStack
</pre>

<p>
Input for the adcfgclone.pl command:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Prompt</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">apps password</td>
<td class="org-left">apps0246</td>
</tr>

<tr>
<td class="org-left">hostname</td>
<td class="org-left">uerp28db</td>
</tr>

<tr>
<td class="org-left">domain</td>
<td class="org-left">ckh.oc.com</td>
</tr>

<tr>
<td class="org-left">rac</td>
<td class="org-left">n</td>
</tr>

<tr>
<td class="org-left">sid</td>
<td class="org-left">UERP28</td>
</tr>

<tr>
<td class="org-left">base</td>
<td class="org-left">/project/UERP28/db</td>
</tr>

<tr>
<td class="org-left">utl_file_dir</td>
<td class="org-left">`/UERP28_db01/dbdump/appl_tmp',</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">`/project/UERP28/dbdump/asw/temp',</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">`/project/UERP28/db/11.2.0/appsutil/outbound/UERP28_uerp28db'</td>
</tr>

<tr>
<td class="org-left">port pool</td>
<td class="org-left">7</td>
</tr>
</tbody>
</table></li>

<li>Start DB in open mode</li>

<li><p>
Run AutoConfig in the INSTE8_SETUP mode on the database tier as follows:
</p>
<pre class="example">
$ perl /project/UERP28/db/11.2.0/appsutil/bin/adconfig.sh contextfile=&lt;CONTEXT_FILE&gt; \
       run=INSTE8_SETUP
</pre></li>

<li><p>
Run library update script
</p>
<pre class="example">
$ cd /project/UERP28/db/11.2.0/appsutil/install/&lt;CONTEXT NAME&gt;
$ sqlplus "/ as sysdba" @adupdlib.sql so
</pre></li>

<li><p>
Configure Target database
</p>
<pre class="example">
$ cd /project/UERP28/db/11.2.0/appsutil/clone/bin
$ perl adcfgclone.pl dbconfig &lt;Database Target Context File&gt;
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org5f9714c" class="outline-2">
<h2 id="org5f9714c">Configure Primary App Tier</h2>
<div class="outline-text-2" id="text-org5f9714c">
</div>
<div id="outline-container-orge6e7930" class="outline-3">
<h3 id="orge6e7930">Restore App Tier Software Backup from Stage</h3>
<div class="outline-text-3" id="text-orge6e7930">
<p>
Before clone, need restore fs_ne got from the customer (the reason is because of the customization by customer, the clone will be too time-consuming if fs_ne is not there, this is a special needs from CKHH)
</p>
<pre class="example">
$ tar zxvf /stage/CKHHPOC/oracle/filebackup/fs2_EBSapps_20170926.tar.gz \
      -C /project/UERP28/apps/fs2
$ tar zxvf /stage/CKHHPOC/oracle/filebackup/fs_ne_EBSapps_20170926.tar.gz \
      -C /project/UERP28/apps
</pre>
</div>
</div>

<div id="outline-container-org86407e3" class="outline-3">
<h3 id="org86407e3">Configure</h3>
<div class="outline-text-3" id="text-org86407e3">
<pre class="example">
$ cd /project/UERP28/apps/fs2/EBSapps/comn/clone/bin
$ perl adcfgclone.pl appsTier dualfs
</pre>

<p>
Input for the adcfgclone.pl command:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Prompt</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">apps password</td>
<td class="org-left">apps0246</td>
</tr>

<tr>
<td class="org-left">weblogic password</td>
<td class="org-left">wls02468</td>
</tr>

<tr>
<td class="org-left">hostname</td>
<td class="org-left">apperpu01</td>
</tr>

<tr>
<td class="org-left">domain</td>
<td class="org-left">ckh.oc.com</td>
</tr>

<tr>
<td class="org-left">sid</td>
<td class="org-left">UERP28</td>
</tr>

<tr>
<td class="org-left">db node</td>
<td class="org-left">uerp28db</td>
</tr>

<tr>
<td class="org-left">domain</td>
<td class="org-left">ckh.oc.com</td>
</tr>

<tr>
<td class="org-left">base</td>
<td class="org-left">/project/UERP28/apps</td>
</tr>

<tr>
<td class="org-left">instance home</td>
<td class="org-left">/project/UERP28/apps</td>
</tr>

<tr>
<td class="org-left">preserve display</td>
<td class="org-left">n</td>
</tr>

<tr>
<td class="org-left">target system display</td>
<td class="org-left">&lt;enter&gt;</td>
</tr>

<tr>
<td class="org-left">web entry point services</td>
<td class="org-left">enabled</td>
</tr>

<tr>
<td class="org-left">web application services</td>
<td class="org-left">enabled</td>
</tr>

<tr>
<td class="org-left">system batch processing services</td>
<td class="org-left">enabled</td>
</tr>

<tr>
<td class="org-left">other services</td>
<td class="org-left">disabled</td>
</tr>

<tr>
<td class="org-left">the same port values as the source system</td>
<td class="org-left">n</td>
</tr>

<tr>
<td class="org-left">port pool</td>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">patching fs port pool</td>
<td class="org-left">2</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org19e1b38" class="outline-2">
<h2 id="org19e1b38">Prepare with CKHH Instructions before Configure Multinodes</h2>
<div class="outline-text-2" id="text-org19e1b38">
<p>
Basically just following erp28_post_cloing_20171016.txt instructions from CKHH
</p>
</div>
</div>
<div id="outline-container-org96d1c18" class="outline-2">
<h2 id="org96d1c18">Preclone in Primary App Node</h2>
<div class="outline-text-2" id="text-org96d1c18">
<ol class="org-ol">
<li><p>
In node apperpu01
</p>
<pre class="example">
$ cd /project/UERP28/apps
$ . EBSapps.env run
$ perl $ADMIN_SCRIPTS_HOME/adpreclone.pl appsTier
$ . EBSapps.env patch
$ $ADMIN_SCRIPTS_HOME/adadminsrvctl.sh start forcepatchfs
$ perl $ADMIN_SCRIPTS_HOME/adpreclone.pl appsTier
</pre></li>

<li>Stop  EBS services in apperpu01, package following directories and copy into to apperpu02, then unpack into the same directory structure.
<ul class="org-ul">
<li>/project/UERP28/apps/fs2/EBSapps</li>
<li>/project/UERP28/apps/fs_ne</li>
</ul></li>

<li>Start all EBS services in apperpu01 including adminserver in patching filesystem.</li>
</ol>
</div>
</div>
<div id="outline-container-org0da3465" class="outline-2">
<h2 id="org0da3465">Configure Secondary App Node</h2>
<div class="outline-text-2" id="text-org0da3465">
<ol class="org-ol">
<li><p>
run adcfgclone.pl
</p>
<pre class="example">
$ cd /project/UERP28/apps/fs2/EBSapps/comn/clone/bin
$ perl adcfgclone.pl appsTier dualfs
</pre></li>

<li><p>
Add OTD information for secondary node by edit $CONTEXT_FILE
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Parameter</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">s_url_protocol</td>
<td class="org-left">https</td>
</tr>

<tr>
<td class="org-left">s_local_url_protocol</td>
<td class="org-left">https</td>
</tr>

<tr>
<td class="org-left">s_webentryurlprotocol</td>
<td class="org-left">https</td>
</tr>

<tr>
<td class="org-left">s_webentryhost</td>
<td class="org-left">uerp28</td>
</tr>

<tr>
<td class="org-left">s_webentrydomain</td>
<td class="org-left">hwl-ebis.com</td>
</tr>

<tr>
<td class="org-left">s_active_webport</td>
<td class="org-left">8828</td>
</tr>

<tr>
<td class="org-left">s_login_page</td>
<td class="org-left"><a href="https://uerp28.hwl-ebis.com:8828/OA_HTML/AppsLocalLogin.jsp">https://uerp28.hwl-ebis.com:8828/OA_HTML/AppsLocalLogin.jsp</a></td>
</tr>

<tr>
<td class="org-left">s_external_url</td>
<td class="org-left"><a href="https://uerp28.hwl-ebis.com:8828">https://uerp28.hwl-ebis.com:8828</a></td>
</tr>
</tbody>
</table>

<p>
Then run autoconfig
</p>

<p>
Basically, these values are consistent with the value configured for primary node in section <a href="#org19e1b38">Prepare with CKHH Instructions before Configure Multinodes</a>
</p></li>
</ol>
</div>
</div>
