_org/example.org
* Deregister Primary Node Information from Secondary Node
  According to CKHH's needs, in secondary node:
  #+BEGIN_EXAMPLE
    $ perl /project/UERP28/apps/fs2/EBSapps/appl/fnd/12.0.0/patch/115/bin/txkSetAppsConf.pl \
         -contextfile=/project/UERP28/apps/fs2/inst/apps/UERP28_apperpu02/appl/admin/UERP28_apperpu02.xml \
         -configoption=removeMS -oacore=apperpu01.ckh.oc.com:7204
  #+END_EXAMPLE

  In other side, there is no need to register secondary node information in primary node.

* Post Configuration with CKHH Instruction
  Basically just following erp28_post_cloing_20171016.txt instructions from CKHH. Especially we need to revise context file of secondary node just what we did in primary node.

* Configure PCP
  1. Run update_erpuat_pcp.sql from CKHH (need fill actual primary and secondary node information into the script)
  1. Set the APPLDCP variable to ON in the context file of both nodes.
  2. Shutdown the application tier services of both the nodes and run AutoConfig on each node. After AutoConfig completes successfully verify that the tnsnames.ora (on both CP nodes) has the FNDFS entries of both the nodes.
  3. Ensure that the Internal Monitors on both nodes defined properly and have workshifts assigned to them. Also make sure the Internal Monitor manager is activated by going into Concurrent -> Manager -> Adminitrator and activate the manager as they need to be active on the nodes where the ICM can start in case of a failure..
