_site/posts/example.html

<div id="outline-container-org3ece34e" class="outline-2">
<h2 id="org3ece34e">Deregister Primary Node Information from Secondary Node</h2>
<div class="outline-text-2" id="text-org3ece34e">
<p>
According to CKHH's needs, in secondary node:
</p>
<pre class="example">
$ perl /project/UERP28/apps/fs2/EBSapps/appl/fnd/12.0.0/patch/115/bin/txkSetAppsConf.pl \
     -contextfile=/project/UERP28/apps/fs2/inst/apps/UERP28_apperpu02/appl/admin/UERP28_apperpu02.xml \
     -configoption=removeMS -oacore=apperpu01.ckh.oc.com:7204
</pre>

<p>
In other side, there is no need to register secondary node information in primary node.
</p>
</div>
</div>

<div id="outline-container-orge82e191" class="outline-2">
<h2 id="orge82e191">Post Configuration with CKHH Instruction</h2>
<div class="outline-text-2" id="text-orge82e191">
<p>
Basically just following erp28_post_cloing_20171016.txt instructions from CKHH. Especially we need to revise context file of secondary node just what we did in primary node.
</p>
</div>
</div>

<div id="outline-container-orgf83c00b" class="outline-2">
<h2 id="orgf83c00b">Configure PCP</h2>
<div class="outline-text-2" id="text-orgf83c00b">
<ol class="org-ol">
<li>Run update_erpuat_pcp.sql from CKHH (need fill actual primary and secondary node information into the script)</li>
<li>Set the APPLDCP variable to ON in the context file of both nodes.</li>
<li>Shutdown the application tier services of both the nodes and run AutoConfig on each node. After AutoConfig completes successfully verify that the tnsnames.ora (on both CP nodes) has the FNDFS entries of both the nodes.</li>
<li>Ensure that the Internal Monitors on both nodes defined properly and have workshifts assigned to them. Also make sure the Internal Monitor manager is activated by going into Concurrent -&gt; Manager -&gt; Adminitrator and activate the manager as they need to be active on the nodes where the ICM can start in case of a failure..</li>
</ol>
</div>
</div>

    </div>
  </body>
</html>
